Construction/attempts/test/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "1/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    defaultFaces
    {
        type            wall;
        inGroups        1(wall);
        nFaces          112647;
        startFace       114208;
    }
    upperPatch
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1499;
        startFace       226855;
    }
    lowerPatch
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1502;
        startFace       228354;
    }
)

// ************************************************************************* //
